Revit 2027 API
Room.BaseOffset Property
Get or Set the Base Offset of the Room.
Namespace: Autodesk.Revit.DB.Architecture
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public double BaseOffset { get; set; }
Public Property BaseOffset As Double
	Get
	Set
public:
property double BaseOffset {
	double get ();
	void set (double value);
}
member BaseOffset : float with get, set
Property Value
Double
Remarks
This property is used to get or set the Base Offset of the Room.
See Also
Reference
Room Class
Autodesk.Revit.DB.Architecture Namespace